//**************************While loop ************************************ */
//************Main code ****************** */
/*
while (condition) {
   confirm.log() // यहाँ वह कोड लिखा जाता है जिसे दोहराना है
    count++; // most importent Nahi toh loop infinite ho jayega ---------------------------->
  } */

//------------------------------------------------------------------------------->
/*
let count = 0;

while (count < 5) {
  console.log("Hello World", count);
  count++; // count की वैल्यू को 1 बढ़ाना
} */
//-------------------------------------------------------------->
//---------------------------Sharadha khapra-------------------->
/*

let i = 5;

while (i <= 10) {
  console.log("I =", i);
  i++;
} */
//-------------------------------Do while loop------------------------->

/*

do {
  // यहाँ वह कोड लिखा जाता है जिसे दोहराना है
  i++;
} while (condition);

 Exeample ------------------->
let i = 0;
do {
  console.log("I =", i);
  i++;
} while (i <= 100);
*/
//---------------------------------------------------------->